InformationRegisters/КонтурМаркировка_КлючиАналитикиНоменклатуры1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтурМаркировка_КлючиАналитикиНоменклатуры1С</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючНоменклатуры1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтурМаркировка_КлючиНоменклатуры1С</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипКлючаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючНоменклатуры</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючХарактеристики</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСерии</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КонтурМаркировка_КлючиНоменклатуры1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтурМаркировка_КлючиНоменклатуры1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНоменклатуры</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючХарактеристики</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСерии</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлючаСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КонтурМаркировка_КлючиАналитикиНоменклатуры1С/Ext/RecordSetModule.bsl
// #Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или Не ЗначениеЗаполнено(ЭтотОбъект)
		Или ДополнительныеСвойства.Свойство("ОтключитьЗаполнениеКлюча") Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьКлючи();
	НайтиСуществующиеКлючи();
	СоздатьНовыеКлючи();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Процедура ОчиститьКлючи()
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.КлючНоменклатуры1С = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиСуществующиеКлючи()
	
	// BSLLS:CreateQueryInCycle-off
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.КлючНоменклатуры1С КАК КлючНоменклатуры1С
		|ИЗ
		|	РегистрСведений.КонтурМаркировка_КлючиАналитикиНоменклатуры1С КАК Т
		|ГДЕ
		|	Т.КлючНоменклатуры = &КлючНоменклатуры
		|	И Т.КлючХарактеристики = &КлючХарактеристики
		|	И Т.КлючУпаковки = &КлючУпаковки
		|	И Т.КлючСерии = &КлючСерии");
		Запрос.УстановитьПараметр("КлючНоменклатуры", Запись.КлючНоменклатуры);
		Запрос.УстановитьПараметр("КлючХарактеристики", Запись.КлючХарактеристики);
		Запрос.УстановитьПараметр("КлючУпаковки", Запись.КлючУпаковки);
		Запрос.УстановитьПараметр("КлючСерии", Запись.КлючСерии);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Запись.КлючНоменклатуры1С = Выборка.КлючНоменклатуры1С;
		КонецЕсли;
		
	КонецЦикла;
	// BSLLS:CreateQueryInCycle-on
	
КонецПроцедуры

Процедура СоздатьНовыеКлючи()
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(Запись.КлючНоменклатуры1С) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектКлюча = Справочники.КонтурМаркировка_КлючиНоменклатуры1С.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ОбъектКлюча, Запись);
		ОбъектКлюча.ДополнительныеСвойства.Вставить("ОтключитьЗаписьАналитики");
		ОбъектКлюча.Записать();
		
		Запись.КлючНоменклатуры1С = ОбъектКлюча.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти
